IOsonata/IOsonata/ARM/Nordic/nRF52/nRF52840/exemples/radio_test/src/radio_test.c
        case TRANSMIT_PATTERN_11110000:
            nrf_radio_prefix0_set(NRF_RADIO, 0x6A);
            nrf_radio_base0_set(NRF_RADIO, 0x58FE811B);
            break;

        default:
            return;
    }

    /* Packet configuration:
     * payload length size = 8 bits,
     * 0-byte static length, max 255-byte payload,
     * 4-byte base address length (5-byte full address length),
     * Bit 24: 1 Big endian,
     * Bit 25: 1 Whitening enabled.
     */
    memset(&packet_conf, 0, sizeof(packet_conf));
    packet_conf.lflen = RADIO_LENGTH_LENGTH_FIELD;
    packet_conf.maxlen = (sizeof(m_tx_packet) - 1);
    packet_conf.statlen = 0;
    packet_conf.balen = 4;
    packet_conf.big_endian = true;
    packet_conf.whiteen = true;

    switch (mode)
    {
#if USE_MORE_RADIO_MODES
        case NRF_RADIO_MODE_IEEE802154_250KBIT:
            /* Packet configuration:
             * S1 size = 0 bits,
             * S0 size = 0 bytes,
             * 32-bit preamble.
             */
            packet_conf.plen = NRF_RADIO_PREAMBLE_LENGTH_32BIT_ZERO;
            packet_conf.maxlen = IEEE_MAX_PAYLOAD_LEN;
            packet_conf.balen = 0;
            packet_conf.big_endian = false;
            packet_conf.whiteen = false;

            /* Set fast ramp-up time. */
            nrf_radio_modecnf0_set(NRF_RADIO, true, RADIO_MODECNF0_DTX_Center);
            break;

        case NRF_RADIO_MODE_BLE_LR500KBIT:
        case NRF_RADIO_MODE_BLE_LR125KBIT:
            /* Packet configuration:
             * S1 size = 0 bits,
             * S0 size = 0 bytes,
             * 10-bit preamble.
             */
            packet_conf.plen = NRF_RADIO_PREAMBLE_LENGTH_LONG_RANGE;
            packet_conf.maxlen = IEEE_MAX_PAYLOAD_LEN;
            packet_conf.cilen = 2;
            packet_conf.termlen = 3;
            packet_conf.big_endian = false;
            packet_conf.balen = 3;

            /* Set fast ramp-up time. */
            nrf_radio_modecnf0_set(NRF_RADIO, true, RADIO_MODECNF0_DTX_Center);

            /* Set CRC length; CRC calculation does not include the address
             * field.
             */
            nrf_radio_crc_configure(NRF_RADIO, RADIO_CRCCNF_LEN_Three, NRF_RADIO_CRC_ADDR_SKIP, 0);
            break;
#endif /* USE_MORE_RADIO_MODES */

        case NRF_RADIO_MODE_BLE_2MBIT:
            /* Packet configuration:
             * S1 size = 0 bits,
             * S0 size = 0 bytes,
             * 16-bit preamble.
             */
            packet_conf.plen = NRF_RADIO_PREAMBLE_LENGTH_16BIT;
            break;

        default:
            /* Packet configuration:
             * S1 size = 0 bits,
             * S0 size = 0 bytes,
             * 8-bit preamble.
             */
            packet_conf.plen = NRF_RADIO_PREAMBLE_LENGTH_8BIT;
            break;
    }

    nrf_radio_packet_configure(NRF_RADIO, &packet_conf);
}


/**
 * @brief Function for configuring the radio to use a random address and a 254-byte random payload.
 * The S0 and S1 fields are not used.
 *
 * @param[in] mode Radio mode.
 * @param[in] pattern Radio transmission pattern.
 */
static void generate_modulated_rf_packet(nrf_radio_mode_t mode, transmit_pattern_t pattern)
{
    radio_config(mode, pattern);

    /* One byte used for size, actual size is SIZE-1 */
#if USE_MORE_RADIO_MODES
    if (mode == NRF_RADIO_MODE_IEEE802154_250KBIT)
    {
        m_tx_packet[0] = IEEE_MAX_PAYLOAD_LEN - 1;
    }
    else
    {
        m_tx_packet[0] = sizeof(m_tx_packet) - 1;
    }
#else
    m_tx_packet[0] = sizeof(m_tx_packet) - 1;
#endif /* USE_MORE_RADIO_MODES */

    /* Fill payload with random data. */
    for (uint8_t i = 0; i < sizeof(m_tx_packet) - 1; i++)
    {
        if (pattern == TRANSMIT_PATTERN_RANDOM)
        {
            m_tx_packet[i + 1] = rnd8();
        }
        else if (pattern == TRANSMIT_PATTERN_11001100)
        {
            m_tx_packet[i + 1] = 0xCC;
        }
        else if (pattern == TRANSMIT_PATTERN_11110000)
        {
            m_tx_packet[i + 1] = 0xF0;
        }
        else {
            /* Do nothing. */
        }
    }

    nrf_radio_packetptr_set(NRF_RADIO, m_tx_packet);
}


/**@brief Function for disabling radio.
 */
static void radio_disable(void)
{
    nrf_radio_shorts_set(NRF_RADIO, 0);
    nrf_radio_int_disable(NRF_RADIO, ~0);
    nrf_radio_event_clear(NRF_RADIO, NRF_RADIO_EVENT_DISABLED);

#if defined(NRF21540_DRIVER_ENABLE) && (NRF21540_DRIVER_ENABLE == 1)
    (void)nrf21540_power_down(NRF21540_EXECUTE_NOW, NRF21540_EXEC_MODE_BLOCKING);
#else
    nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_DISABLE);
    while (!nrf_radio_event_check(NRF_RADIO, NRF_RADIO_EVENT_DISABLED))
    {
        /* Do nothing */
    }
#endif
    nrf_radio_event_clear(NRF_RADIO, NRF_RADIO_EVENT_DISABLED);
}


static void radio_unmodulated_tx_carrier(nrf_radio_mode_t mode,
                                         nrf_radio_txpower_t txpower,
                                         uint8_t channel)
{
    radio_disable();

    nrf_radio_mode_set(NRF_RADIO, mode);
#if !defined(NRF21540_DRIVER_ENABLE) || (NRF21540_DRIVER_ENABLE == 0)
    nrf_radio_shorts_enable(NRF_RADIO, NRF_RADIO_SHORT_READY_START_MASK);
#endif
    nrf_radio_txpower_set(NRF_RADIO, txpower);

    radio_channel_set(mode, channel);

#if defined(NRF21540_DRIVER_ENABLE) && (NRF21540_DRIVER_ENABLE == 1)
    (void)nrf21540_tx_set(NRF21540_EXECUTE_NOW, NRF21540_EXEC_MODE_NON_BLOCKING);
#else
    nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_TXEN);
#endif
}


/**
 * @brief Function for starting the modulated TX carrier by repeatedly sending a packet with a random address and
 * a random payload.
 */
static void radio_modulated_tx_carrier(nrf_radio_mode_t mode,
                                       nrf_radio_txpower_t txpower,
                                       uint8_t channel,
                                       transmit_pattern_t pattern)
{
    radio_disable();
    generate_modulated_rf_packet(mode, pattern);

    switch (mode)
    {
#if USE_MORE_RADIO_MODES
        case NRF_RADIO_MODE_IEEE802154_250KBIT:
        case NRF_RADIO_MODE_BLE_LR125KBIT:
        case NRF_RADIO_MODE_BLE_LR500KBIT:
#if defined(NRF21540_DRIVER_ENABLE) && (NRF21540_DRIVER_ENABLE == 1)
            nrf_radio_shorts_enable(NRF_RADIO_SHORT_PHYEND_START_MASK);
#else
            nrf_radio_shorts_enable(NRF_RADIO, NRF_RADIO_SHORT_READY_START_MASK |
                                    NRF_RADIO_SHORT_PHYEND_START_MASK);
#endif
            break;
#endif /* USE_MORE_RADIO_MODES */

        case NRF_RADIO_MODE_BLE_1MBIT:
        case NRF_RADIO_MODE_BLE_2MBIT:
        case NRF_RADIO_MODE_NRF_1MBIT:
        case NRF_RADIO_MODE_NRF_2MBIT:
        default:
#ifdef NRF52832_XXAA
        case NRF_RADIO_MODE_NRF_250KBIT:
#endif /* NRF52832_XXAA */
#if defined(NRF21540_DRIVER_ENABLE) && (NRF21540_DRIVER_ENABLE == 1)
            nrf_radio_shorts_enable(NRF_RADIO_SHORT_END_START_MASK);
#else
            nrf_radio_shorts_enable(NRF_RADIO, NRF_RADIO_SHORT_READY_START_MASK |
                                    NRF_RADIO_SHORT_END_START_MASK);
#endif
            break;
    }

    nrf_radio_mode_set(NRF_RADIO, mode);
    nrf_radio_txpower_set(NRF_RADIO, txpower);

    radio_channel_set(mode, channel);

    m_tx_packet_cnt = 0;

    nrf_radio_event_clear(NRF_RADIO, NRF_RADIO_EVENT_END);
    nrf_radio_int_enable(NRF_RADIO, NRF_RADIO_INT_END_MASK);
#if defined(NRF21540_DRIVER_ENABLE) && (NRF21540_DRIVER_ENABLE == 1)
    (void)nrf21540_tx_set(NRF21540_EXECUTE_NOW, NRF21540_EXEC_MODE_NON_BLOCKING);
#else
    nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_TXEN);
#endif
    while (!nrf_radio_event_check(NRF_RADIO, NRF_RADIO_EVENT_END))
    {
        /* Do nothing */
    }

