IOsonata/IOsonata/ARM/Nordic/nRF52/nRF52840/exemples/radio_test/src/radio_test.c
}


static void radio_modulated_tx_carrier_duty_cycle(nrf_radio_mode_t mode,
                                                  nrf_radio_txpower_t txpower,
                                                  uint8_t channel,
                                                  transmit_pattern_t pattern,
                                                  uint32_t duty_cycle)
{
    // Lookup table with time per byte in each radio MODE
    // Mapped per NRF_RADIO->MODE available on nRF5-series devices @ref <insert ref to mode register>
    static const uint8_t time_in_us_per_byte[16] =
    {8, 4, 32, 8, 4, 64, 16, 0, 0, 0, 0, 0, 0, 0, 0, 32};
    // 1 byte preamble, 5 byte address (BALEN + PREFIX), and sizeof(payload), no CRC
    const uint32_t total_payload_size     = 1 + 5 + sizeof(m_tx_packet);
    const uint32_t total_time_per_payload = time_in_us_per_byte[mode] * total_payload_size;
    // Duty cycle = 100 * Time_on / (time_on + time_off), we need to calculate "time_off" for delay.
    // In addition, the timer includes the "total_time_per_payload", so we need to add this to the total timer cycle.
    uint32_t delay_time = total_time_per_payload +
                          ((100 * total_time_per_payload -
                            (total_time_per_payload * duty_cycle)) / duty_cycle);

    CRITICAL_REGION_ENTER();
    radio_disable();
    generate_modulated_rf_packet(mode, pattern);

    nrf_radio_mode_set(NRF_RADIO, mode);
    nrf_radio_shorts_enable(NRF_RADIO, NRF_RADIO_SHORT_READY_START_MASK |
                            NRF_RADIO_SHORT_END_DISABLE_MASK);
    nrf_radio_txpower_set(NRF_RADIO, txpower);
    radio_channel_set(mode, channel);

    /* We let the TIMER start the radio transmission again. */
    nrfx_timer_disable(&m_timer);
    nrf_timer_shorts_disable(m_timer.p_reg, ~0);
    nrf_timer_int_disable(m_timer.p_reg, ~0);

    nrfx_timer_extended_compare(&m_timer,
                                NRF_TIMER_CC_CHANNEL1,
                                nrfx_timer_us_to_ticks(&m_timer, delay_time),
                                NRF_TIMER_SHORT_COMPARE1_CLEAR_MASK,
                                true);

    nrfx_timer_clear(&m_timer);
    nrfx_timer_enable(&m_timer);
    CRITICAL_REGION_EXIT();
}


static void radio_rx(nrf_radio_mode_t mode, uint8_t channel, transmit_pattern_t pattern)
{
    radio_disable();

    nrf_radio_mode_set(NRF_RADIO, mode);
#if defined(NRF21540_DRIVER_ENABLE) && (NRF21540_DRIVER_ENABLE == 1)
    nrf_radio_shorts_enable(NRF_RADIO_SHORT_END_START_MASK);
#else
    nrf_radio_shorts_enable(NRF_RADIO, NRF_RADIO_SHORT_READY_START_MASK |
                            NRF_RADIO_SHORT_END_START_MASK);
#endif
    nrf_radio_packetptr_set(NRF_RADIO, m_rx_packet);

    radio_config(mode, pattern);
    radio_channel_set(mode, channel);

    m_rx_packet_cnt = 0;

    nrf_radio_int_enable(NRF_RADIO, NRF_RADIO_INT_CRCOK_MASK);
#if defined(NRF21540_DRIVER_ENABLE) && (NRF21540_DRIVER_ENABLE == 1)
    (void)nrf21540_rx_set(NRF21540_EXECUTE_NOW, NRF21540_EXEC_MODE_NON_BLOCKING);
#else
    nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_RXEN);
#endif
}


static void radio_sweep_start(uint8_t channel, uint32_t delay_ms)
{
    m_current_channel = channel;

    nrfx_timer_disable(&m_timer);
    nrf_timer_shorts_disable(m_timer.p_reg, ~0);
    nrf_timer_int_disable(m_timer.p_reg, ~0);

    nrfx_timer_extended_compare(&m_timer,
            NRF_TIMER_CC_CHANNEL0,
            nrfx_timer_ms_to_ticks(&m_timer, delay_ms),
            NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK,
            true);

    nrfx_timer_clear(&m_timer);
    nrfx_timer_enable(&m_timer);
}


void radio_test_start(radio_test_config_t * p_config)
{
    switch (p_config->type)
    {
        case UNMODULATED_TX:
            radio_unmodulated_tx_carrier(p_config->mode,
                                         p_config->params.unmodulated_tx.txpower,
                                         p_config->params.unmodulated_tx.channel);
            break;
        case MODULATED_TX:
            radio_modulated_tx_carrier(p_config->mode,
                                       p_config->params.modulated_tx.txpower,
                                       p_config->params.modulated_tx.channel,
                                       p_config->params.modulated_tx.pattern);
            break;
        case RX:
            radio_rx(p_config->mode,
                     p_config->params.rx.channel,
                     p_config->params.rx.pattern);
            break;
        case TX_SWEEP:
            radio_sweep_start(p_config->params.tx_sweep.channel_start,
                              p_config->params.tx_sweep.delay_ms);
            break;
        case RX_SWEEP:
            radio_sweep_start(p_config->params.rx_sweep.channel_start,
                              p_config->params.rx_sweep.delay_ms);
            break;
        case MODULATED_TX_DUTY_CYCLE:
            radio_modulated_tx_carrier_duty_cycle(p_config->mode,
                                                  p_config->params.modulated_tx_duty_cycle.txpower,
                                                  p_config->params.modulated_tx_duty_cycle.channel,
                                                  p_config->params.modulated_tx_duty_cycle.pattern,
                                                  p_config->params.modulated_tx_duty_cycle.duty_cycle);
            break;
    }
}


void radio_test_cancel(void)
{
    nrfx_timer_disable(&m_timer);
    radio_disable();
}


void radio_rx_stats_get(radio_rx_stats_t * p_rx_stats)
{
    size_t size;

#if USE_MORE_RADIO_MODES
    nrf_radio_mode_t radio_mode;

    radio_mode = nrf_radio_mode_get(NRF_RADIO);
    if (radio_mode == NRF_RADIO_MODE_IEEE802154_250KBIT)
    {
        size = IEEE_MAX_PAYLOAD_LEN;
    }
    else
    {
        size = sizeof(m_rx_packet);
    }
#else
    size = sizeof(m_rx_packet);
#endif /* USE_MORE_RADIO_MODES */

    p_rx_stats->last_packet.buf = m_rx_packet;
    p_rx_stats->last_packet.len = size;
    p_rx_stats->packet_cnt = m_rx_packet_cnt;
}


void toggle_dcdc_state(uint8_t dcdc_state)
{
#ifdef NRF52840_XXAA
    if (dcdc_state == 0)
    {
        NRF_POWER->DCDCEN0 = (NRF_POWER->DCDCEN0 == POWER_DCDCEN0_DCDCEN_Disabled) ? 1 : 0;
    }
    else if (dcdc_state == 1)
    {
        NRF_POWER->DCDCEN = (NRF_POWER->DCDCEN == POWER_DCDCEN_DCDCEN_Disabled) ? 1 : 0;
    }
    else
    {
        // Do nothing.
    }
#else
    if (dcdc_state <= 1)
    {
        NRF_POWER->DCDCEN = dcdc_state;
    }
#endif // NRF52840_XXAA
}


/**
 * @brief Function for handling the Timer 0 interrupt used for the TX or RX sweep. The carrier is started with the new channel,
 * and the channel is incremented for the next interrupt.
 */
static void timer_handler(nrf_timer_event_t event_type, void * p_context)
{
    const radio_test_config_t * p_config = (const radio_test_config_t *) p_context;

    if (event_type == NRF_TIMER_EVENT_COMPARE0)
    {
        uint8_t channel_start;
        uint8_t channel_end;

