IOsonata/IOsonata/ARM/Nordic/nRF52/nRF52840/exemples/radio_test/src/radio_test.c
        if (p_config->type == TX_SWEEP)
        {
            radio_unmodulated_tx_carrier(p_config->mode,
                                         p_config->params.tx_sweep.txpower,
                                         m_current_channel);

            channel_start = p_config->params.tx_sweep.channel_start;
            channel_end   = p_config->params.tx_sweep.channel_end;
        }
        else if (p_config->type == RX_SWEEP)
        {
            radio_rx(p_config->mode, m_current_channel, p_config->params.rx.pattern);

            channel_start = p_config->params.rx_sweep.channel_start;
            channel_end   = p_config->params.rx_sweep.channel_end;
        }
        else
        {
            NRF_LOG_ERROR("Unexpected test type: %d\n", p_config->type);
            return;
        }

        m_current_channel++;
        if (m_current_channel > channel_end)
        {
                m_current_channel = channel_start;
        }
    }

    if (event_type == NRF_TIMER_EVENT_COMPARE1)
    {
#if defined(NRF21540_DRIVER_ENABLE) && (NRF21540_DRIVER_ENABLE == 1)
        (void)nrf21540_tx_set(NRF21540_EXECUTE_NOW, NRF21540_EXEC_MODE_NON_BLOCKING);
#else
        nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_TXEN);
#endif
    }
}


static void timer_init(const radio_test_config_t * p_config)
{
    nrfx_err_t          err;
    nrfx_timer_config_t timer_cfg =
    {
        .frequency = NRF_TIMER_FREQ_1MHz,
        .mode      = NRF_TIMER_MODE_TIMER,
        .bit_width = NRF_TIMER_BIT_WIDTH_24,
        .p_context = (void *) p_config,
#if defined(NRF21540_DRIVER_ENABLE) && (NRF21540_DRIVER_ENABLE == 1)
        // nRF21540 driver interrupts need to have higher interrupts priorities than interrupt which services nRF21540.
        .interrupt_priority = NRFX_TIMER_DEFAULT_CONFIG_IRQ_PRIORITY + 1,
#else
        .interrupt_priority = NRFX_TIMER_DEFAULT_CONFIG_IRQ_PRIORITY,
#endif
    };

    err = nrfx_timer_init(&m_timer, &timer_cfg, timer_handler);
    if (err != NRFX_SUCCESS)
    {
        NRF_LOG_ERROR("nrfx_timer_init failed with: %d\n", err);
    }
}


void RADIO_IRQHandler(void)
{
    if (nrf_radio_event_check(NRF_RADIO, NRF_RADIO_EVENT_CRCOK))
    {
        nrf_radio_event_clear(NRF_RADIO, NRF_RADIO_EVENT_CRCOK);
        m_rx_packet_cnt++;
    }

    if (nrf_radio_event_check(NRF_RADIO, NRF_RADIO_EVENT_END))
    {
        nrf_radio_event_clear(NRF_RADIO, NRF_RADIO_EVENT_END);

        m_tx_packet_cnt++;
        if (m_tx_packet_cnt == m_p_test_config->params.modulated_tx.packets_num)
        {
            radio_disable();
            m_p_test_config->params.modulated_tx.cb();
        }
    }
}


void radio_test_init(radio_test_config_t * p_config)
{
    if (!m_p_test_config)
    {
        nrf_rng_task_trigger(NRF_RNG, NRF_RNG_TASK_START);

#ifdef NVMC_ICACHECNF_CACHEEN_Msk
        nrf_nvmc_icache_config_set(NRF_NVMC, NRF_NVMC_ICACHE_ENABLE);
#endif // NVMC_ICACHECNF_CACHEEN_Msk

        timer_init(p_config);

#if defined(NRF21540_DRIVER_ENABLE) && (NRF21540_DRIVER_ENABLE == 1)
        // nRF21540 driver interrupts need to have higher interrupts priorities than interrupt which services nRF21540.
        NVIC_SetPriority(RADIO_IRQn, NRFX_TIMER_DEFAULT_CONFIG_IRQ_PRIORITY + 1);
#endif
        NVIC_EnableIRQ(RADIO_IRQn);
        __enable_irq();

        m_p_test_config = p_config;
    }
    else
    {
        // Already initialized, do nothing
    }
}

/**
 * @}
 */
